const { Pool } = require('pg');// Імпортуємо клас Pool з пакета 'pg' (PostgreSQL клієнт для Node.js)
// Pool — це механізм керування кількома з'єднаннями з базою даних (пул з'єднань)
const pool = new Pool({// Створюємо (екземпляр) пулу з’єднань із налаштуваннями доступу до PostgreSQL
  user: 'postgres',// Ім'я користувача бази даних
  host: 'localhost', // Сервер, на якому розміщена база даних
  database: 'equeue',// Назва бази даних
  password: 'ilovelondon08',// Пароль до бази
  port: 5432,// Порт, на якому слухає PostgreSQL (стандартний)
});
// Експортуємо об'єкт pool, щоб можна було використовувати його в інших модулях
module.exports = pool;// Наприклад, у репозиторії для виконання SQL-запитів: pool.query(...)
// Експортуємо пул, щоб інші модулі могли виконувати SQL-запити